
# System/Dev Tooling
brew "git"
brew "neovim" 
brew "ripgrep"
brew "bat"
brew "tmux"
brew "cocoapods"
brew "mise"  
brew "fish"
cask "claude-code"
brew "starship"
brew "firebase-cli"
brew "docker"
brew "colima"
brew "universal-ctags"


# Applications
cask "visual-studio-code"
cask "ghostty"
cask "brave-browser"
cask "claude"

