
# System/Dev Tooling
brew "git"
brew "gh"
brew "neovim" 
brew "ripgrep"
brew "fzf"
brew "bat"
brew "tmux"
brew "cocoapods"
brew "mise"  
brew "fish"
cask "claude-code"
brew "starship"
brew "firebase-cli"
brew "docker"
brew "docker-compose"
brew "colima"
brew "universal-ctags"
brew "git-delta"
brew "nnn"
brew "tree"
brew "vhs"
brew "httpie"
brew "hurl"
brew "chafa"
brew "flyctl"


# Applications
cask "visual-studio-code"
cask "ghostty"
cask "brave-browser"
cask "claude"

